In [4]:
# import libraries
import pandas as pd

In [92]:
# read in data from "titanic.xls" file
location = "datasets/titanic.xls"
titanic_df = pd.read_excel(location)

In [93]:
# show first 5 rows of dataframe
titanic_df.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

In [94]:
# show column names for "titanic_df"
titanic_df.columns

Index(['pclass', 'survived', 'name', 'sex', 'age', 'sibsp', 'parch', 'ticket',
       'fare', 'cabin', 'embarked', 'boat', 'body', 'home.dest'],
      dtype='object')

In [95]:
#Show sum of fare grouped by pclass
titanic_df.groupby('pclass')['fare'].sum()

pclass
1    28265.4043
2     5866.6374
3     9418.4452
Name: fare, dtype: float64

In [96]:
#Show sum of survived grouped by pclass
titanic_df.groupby('pclass')['survived'].sum()

pclass
1    200
2    119
3    181
Name: survived, dtype: int64

In [97]:
#Show sum of gender grouped by survived
titanic_df.groupby('sex')['survived'].sum()

sex
female    339
male      161
Name: survived, dtype: int64

In [98]:
#Show sum of gender grouped by pclass
titanic_df.groupby('pclass')['pclass'].sum()

pclass
1     323
2     554
3    2127
Name: pclass, dtype: int64

In [99]:
#Oldest passenger
titanic_df['age'].max()

80.0

In [100]:
#Youngest passenger
titanic_df['age'].min()

0.1667

In [101]:
# of survivors = 339 F + 161 M from earlier stat
titanic_df['survived'].sum()

500

In [102]:
#Sum of pclass = 323 pclass 1 + 554 pclass 2 + 2127 pclass 3 from earlier stat
titanic_df['pclass'].sum()

3004

In [103]:
# mean age
titanic_df['age'].mean()

29.8811345124283

In [104]:
#maximum fare
titanic_df['fare'].max()

512.3292

In [105]:
#minimum fare
titanic_df['fare'].min()

0.0

In [106]:
#Show sum of parch grouped by fare
titanic_df.groupby('parch')['fare'].sum()

parch
0    26356.1494
1     8513.3209
2     6932.1291
3      693.5083
4      628.3417
5      194.1375
6       93.8000
9      139.1000
Name: fare, dtype: float64

In [107]:
#Show sum of parch grouped by survived
titanic_df.groupby('parch')['survived'].sum()

parch
0    336
1    100
2     57
3      5
4      1
5      1
6      0
9      0
Name: survived, dtype: int64

In [108]:
#Show sum of sibsp grouped by fare
titanic_df.groupby('sibsp')['fare'].sum()

sibsp
0    22949.0113
1    15538.9046
2     2055.5042
3     1426.6418
4      673.0750
5      281.4000
8      625.9500
Name: fare, dtype: float64

In [109]:
#Show sum of sibsp grouped by survived
titanic_df.groupby('sibsp')['survived'].sum()

sibsp
0    309
1    163
2     19
3      6
4      3
5      0
8      0
Name: survived, dtype: int64

In [110]:
#Show sum of pclass grouped by parch
titanic_df.groupby('pclass')['parch'].sum()

pclass
1    118
2    102
3    284
Name: parch, dtype: int64

In [111]:
#Show sum of pclass grouped by sibsp
titanic_df.groupby('pclass')['sibsp'].sum()

pclass
1    141
2    109
3    403
Name: sibsp, dtype: int64

In [112]:
# mode age
titanic_df['age'].mode()

0    24.0
dtype: float64

In [113]:
# standard deviation age
titanic_df['age'].std()

14.413499699923594

In [114]:
# mean fare
titanic_df['fare'].mean()

33.29547928134572

In [115]:
# mode fare
titanic_df['fare'].mode()

0    8.05
dtype: float64

In [116]:
# std fare
titanic_df['fare'].std()

51.758668239174135

In [117]:
#median age
titanic_df['age'].median()

28.0

In [118]:
#describe age
titanic_df['age'].describe()

count    1046.000000
mean       29.881135
std        14.413500
min         0.166700
25%        21.000000
50%        28.000000
75%        39.000000
max        80.000000
Name: age, dtype: float64

In [119]:
#describe survived
titanic_df['survived'].describe()

count    1309.000000
mean        0.381971
std         0.486055
min         0.000000
25%         0.000000
50%         0.000000
75%         1.000000
max         1.000000
Name: survived, dtype: float64

In [120]:
#describe fare
titanic_df['fare'].describe()

count    1308.000000
mean       33.295479
std        51.758668
min         0.000000
25%         7.895800
50%        14.454200
75%        31.275000
max       512.329200
Name: fare, dtype: float64

In [121]:
titanic_df['fare'].unique()

array([211.3375, 151.55  ,  26.55  ,  77.9583,   0.    ,  51.4792,
        49.5042, 227.525 ,  69.3   ,  78.85  ,  30.    ,  25.925 ,
       247.5208,  76.2917,  75.2417,  52.5542, 221.7792,  26.    ,
        91.0792, 135.6333,  35.5   ,  31.    , 164.8667, 262.375 ,
        55.    ,  30.5   ,  50.4958,  39.6   ,  27.7208, 134.5   ,
        26.2875,  27.4458, 512.3292,   5.    ,  47.1   , 120.    ,
        61.175 ,  53.1   ,  86.5   ,  29.7   , 136.7792,  52.    ,
        25.5875,  83.1583,  25.7   ,  71.    ,  71.2833,  57.    ,
        81.8583, 106.425 ,  56.9292,  78.2667,  31.6792,  31.6833,
       110.8833,  26.3875,  27.75  , 263.    , 133.65  ,  49.5   ,
        79.2   ,  38.5   , 211.5   ,  59.4   ,  89.1042,  34.6542,
        28.5   , 153.4625,  63.3583,  55.4417,  76.7292,  42.4   ,
        83.475 ,  93.5   ,  42.5   ,  51.8625,  50.    ,  57.9792,
        90.    ,  30.6958,  80.    ,  28.7125,  25.9292,  39.4   ,
        45.5   , 146.5208,  82.1708,  57.75  , 113.275 ,  26.2833,
       108.9   ,  25.7417,  61.9792,  66.6   ,  40.125 ,  55.9   ,
        60.    ,  82.2667,  32.3208,  79.65  ,  28.5375,  33.5   ,
        34.0208,  75.25  ,  77.2875,  61.3792,  35.    ,  24.    ,
        13.    ,  11.5   ,  10.5   ,  12.525 ,  39.    ,  29.    ,
        21.    ,  13.5   ,  26.25  ,  36.75  ,  73.5   ,  31.5   ,
        23.    ,  32.5   ,  13.8583,  14.5   ,  33.    ,  65.    ,
        16.    ,  12.275 ,  27.    ,  15.    ,  13.7917,  12.35  ,
        10.7083,  41.5792,  12.    ,  12.875 ,  15.0458,  37.0042,
        15.5792,  19.5   ,  14.    ,   9.6875,  30.0708,  13.8625,
        15.05  ,  12.7375,  15.0333,  18.75  ,  12.65  ,  15.75  ,
         7.55  ,  20.25  ,   7.65  ,   7.925 ,   7.2292,   7.25  ,
         8.05  ,   9.475 ,   9.35  ,  18.7875,   7.8875,   7.05  ,
         8.3   ,  22.525 ,   7.8542,  31.275 ,   7.775 ,   7.7958,
         7.8958,  17.8   ,  31.3875,   7.225 ,  14.4583,  15.85  ,
        19.2583,  14.4542,   7.8792,   4.0125,  56.4958,   7.75  ,
        15.2458,  15.5   ,  16.1   ,   7.725 ,   7.0458,   7.2833,
         7.8208,   6.75  ,   8.6625,   7.7333,   7.4958,   7.6292,
        15.9   ,   8.1583,  10.5167,  10.1708,   6.95  ,  14.4   ,
        24.15  ,  17.4   ,   9.5   ,  20.575 ,  12.475 ,  13.9   ,
         6.975 ,  15.1   ,  34.375 ,   7.7417,  20.525 ,   7.85  ,
        46.9   ,   8.3625,   9.8458,   8.85  ,  19.9667,  14.1083,
         6.8583,   8.9625,  12.2875,   6.45  ,   7.0542,   8.1125,
         6.4958,   8.6542,  11.1333,  23.45  ,   9.825 ,   7.125 ,
         8.4333,   7.5208,  13.4167,   7.8292,   7.7375,  22.025 ,
        12.1833,   9.5875,   9.4833,  25.4667,   6.4375,  15.55  ,
         7.5792,   7.1417,  23.25  ,   7.7875,   8.0292,   8.4583,
        15.7417,  11.2417,   7.8   ,   6.2375,   9.225 ,   3.1708,
         8.4042,   7.3125,   9.2167,   8.6833,  21.075 ,  39.6875,
         8.7125,  13.775 ,   7.    ,  22.3583,   8.1375,  29.125 ,
         7.7208,  20.2125,   7.7292,   7.575 ,  69.55  ,   9.325 ,
        21.6792,  16.7   ,   7.7792,  27.9   ,      nan,   9.8375,
        10.4625,   8.5167,   9.8417,   9.    ,  18.    ,   7.875 ])

In [122]:
titanic_df['age'].unique()

array([29.    ,  0.9167,  2.    , 30.    , 25.    , 48.    , 63.    ,
       39.    , 53.    , 71.    , 47.    , 18.    , 24.    , 26.    ,
       80.    ,     nan, 50.    , 32.    , 36.    , 37.    , 42.    ,
       19.    , 35.    , 28.    , 45.    , 40.    , 58.    , 22.    ,
       41.    , 44.    , 59.    , 60.    , 33.    , 17.    , 11.    ,
       14.    , 49.    , 76.    , 46.    , 27.    , 64.    , 55.    ,
       70.    , 38.    , 51.    , 31.    ,  4.    , 54.    , 23.    ,
       43.    , 52.    , 16.    , 32.5   , 21.    , 15.    , 65.    ,
       28.5   , 45.5   , 56.    , 13.    , 61.    , 34.    ,  6.    ,
       57.    , 62.    , 67.    ,  1.    , 12.    , 20.    ,  0.8333,
        8.    ,  0.6667,  7.    ,  3.    , 36.5   , 18.5   ,  5.    ,
       66.    ,  9.    ,  0.75  , 70.5   , 22.5   ,  0.3333,  0.1667,
       40.5   , 10.    , 23.5   , 34.5   , 20.5   , 30.5   , 55.5   ,
       38.5   , 14.5   , 24.5   , 60.5   , 74.    ,  0.4167, 11.5   ,
       26.5   ])

In [123]:
titanic_df['age'].value_counts()

24.0000    47
22.0000    43
21.0000    41
30.0000    40
18.0000    39
           ..
26.5000     1
67.0000     1
70.5000     1
76.0000     1
0.6667      1
Name: age, Length: 98, dtype: int64

In [124]:
titanic_df['survived'].value_counts()

0    809
1    500
Name: survived, dtype: int64

In [125]:
titanic_df.isnull()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,False,False,False,False,False,False,False,False,False,False,False,False,True,False
1,False,False,False,False,False,False,False,False,False,False,False,False,True,False
2,False,False,False,False,False,False,False,False,False,False,False,True,True,False
3,False,False,False,False,False,False,False,False,False,False,False,True,False,False
4,False,False,False,False,False,False,False,False,False,False,False,True,True,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1304,False,False,False,False,False,False,False,False,False,True,False,True,False,True
1305,False,False,False,False,True,False,False,False,False,True,False,True,True,True
1306,False,False,False,False,False,False,False,False,False,True,False,True,False,True
1307,False,False,False,False,False,False,False,False,False,True,False,True,True,True
1308,False,False,False,False,False,False,False,False,False,True,False,True,True,True

In [126]:
titanic_df['embarked'].isnull().sum()

2

In [127]:
titanic_df['home.dest'].isnull().sum()

564

In [128]:
titanic_df[titanic_df['survived'].notnull()]

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1304,3,0,"Zabour, Miss. Hileni",female,14.5000,1,0,2665,14.4542,NaN,C,NaN,328.0,NaN
1305,3,0,"Zabour, Miss. Thamine",female,NaN,1,0,2665,14.4542,NaN,C,NaN,NaN,NaN
1306,3,0,"Zakarian, Mr. Mapriededer",male,26.5000,0,0,2656,7.2250,NaN,C,NaN,304.0,NaN
1307,3,0,"Zakarian, Mr. Ortin",male,27.0000,0,0,2670,7.2250,NaN,C,NaN,NaN,NaN
1308,3,0,"Zimmerman, Mr. Leo",male,29.0000,0,0,315082,7.8750,NaN,S,NaN,NaN,NaN

In [129]:
titanic_df[titanic_df['age'].notnull()].max()

pclass                                    3
survived                                  1
name        van Billiard, Mr. Austin Blyler
sex                                    male
age                                      80
sibsp                                     8
parch                                     6
fare                                512.329
body                                    328
dtype: object

In [132]:
titanic_df[titanic_df['age'].notnull()].min()

pclass                        1
survived                      0
name        Abbing, Mr. Anthony
sex                      female
age                      0.1667
sibsp                         0
parch                         0
fare                          0
body                          1
dtype: object

In [179]:
# import libraries
import pandas as pd

# read in data from "titanic.xls" file
location = "datasets/titanic.xls"
data = pd.read_excel (location)
df = pd.DataFrame(data, columns= ['pclass','survived','name','sex','age','sibsp','parch','ticket','fare','cabin','embarked','boat','body','home.dest'])
print(df)

#export the titanic xls to sql

import os #version works on windows, mac
import sqlite3 as lite

db_filename = r'titanic.db'
con = lite.connect(db_filename)
df.to_sql('titanic', con,  
                  schema=None, if_exists='replace', index=True, 
                  index_label=None, chunksize=None, dtype=None)
con.close()

      pclass  survived                                             name  \
0          1         1                    Allen, Miss. Elisabeth Walton
1          1         1                   Allison, Master. Hudson Trevor
2          1         0                     Allison, Miss. Helen Loraine
3          1         0             Allison, Mr. Hudson Joshua Creighton
4          1         0  Allison, Mrs. Hudson J C (Bessie Waldo Daniels)
...      ...       ...                                              ...
1304       3         0                             Zabour, Miss. Hileni
1305       3         0                            Zabour, Miss. Thamine
1306       3         0                        Zakarian, Mr. Mapriededer
1307       3         0                              Zakarian, Mr. Ortin
1308       3         0                               Zimmerman, Mr. Leo

         sex      age  sibsp  parch  ticket      fare    cabin embarked boat  \
0     female  29.0000      0      0   24160  211.3375       B5        S    2
1       male   0.9167      1      2  113781  151.5500  C22 C26        S   11
2     female   2.0000      1      2  113781  151.5500  C22 C26        S  NaN
3       male  30.0000      1      2  113781  151.5500  C22 C26        S  NaN
4     female  25.0000      1      2  113781  151.5500  C22 C26        S  NaN
...      ...      ...    ...    ...     ...       ...      ...      ...  ...
1304  female  14.5000      1      0    2665   14.4542      NaN        C  NaN
1305  female      NaN      1      0    2665   14.4542      NaN        C  NaN
1306    male  26.5000      0      0    2656    7.2250      NaN        C  NaN
1307    male  27.0000      0      0    2670    7.2250      NaN        C  NaN
1308    male  29.0000      0      0  315082    7.8750      NaN        S  NaN

       body                        home.dest
0       NaN                     St Louis, MO
1       NaN  Montreal, PQ / Chesterville, ON
2       NaN  Montreal, PQ / Chesterville, ON
3     135.0  Montreal, PQ / Chesterville, ON
4       NaN  Montreal, PQ / Chesterville, ON
...     ...                              ...
1304  328.0                              NaN
1305    NaN                              NaN
1306  304.0                              NaN
1307    NaN                              NaN
1308    NaN                              NaN

[1309 rows x 14 columns]

In [185]:
conn = sqlite3.connect("titanic.db")
c = conn.cursor()
pd.read_sql("SELECT * FROM titanic LIMIT 5", conn)

,index,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,None,NaN,"Montreal, PQ / Chesterville, ON"
3,3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,None,135.0,"Montreal, PQ / Chesterville, ON"
4,4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S,None,NaN,"Montreal, PQ / Chesterville, ON"